Web/library_app/app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors" WHERE (name like '%jane%')  ORDER BY created_at DESC
---
  def index
    if params[:search]
      @authors = Author.search(params[:search]).order("created_at DESC")

INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "George Orwell"], ["created_at", "2017-03-28 15:53:38.178845"], ["updated_at", "2017-03-28 15:53:38.178845"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save