Web/library_app/app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE (title like '%1984%')  ORDER BY created_at DESC
---
  def index
    if params[:search]
      @items = Item.search(params[:search]).order("created_at DESC")

INSERT INTO "items" ("title", "ISBN", "Description", "author", "avaliability", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "avaliability" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["avaliability", "1"], ["updated_at", "2017-04-30 13:12:14.183906"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)