Web/library_app/app/controllers/roles_controller.rb

  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("role", "created_at", "updated_at") VALUES (?, ?, ?)  [["role", "Admin"], ["created_at", "2017-03-17 11:25:17.045602"], ["updated_at", "2017-03-17 11:25:17.045602"]]

  def update
    respond_to do |format|
      if @role.update(role_params)
---
UPDATE "roles" SET "level" = ?, "updated_at" = ? WHERE "roles"."id" = ?  [["level", 3], ["updated_at", "2017-04-02 09:42:34.300443"], ["id", 4]]

  def destroy
    @role.destroy
---
DELETE FROM "roles" WHERE "roles"."id" = ?  [["id", 3]]