Web/library_app/app/controllers/searches_controller.rb

  def create
    @search = Search.create!(params[:search])
---
INSERT INTO "searches" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-04-24 20:59:53.061470"], ["updated_at", "2017-04-24 20:59:53.061470"]]

  def show
    @search = Search.find(params[:id])
---
SELECT  "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT 1  [["id", 0]]