Web/library_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "password_digest", "suspend_user", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)